# ClearSortGroupFields Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ClearSortGroupFields Method
ScheduleDefinition Class See Also
---
Removes all sorting/grouping fields.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ClearSortGroupFields()
```

Visual Basic
---
```text
Public Sub ClearSortGroupFields
```

Visual C++
---
```text
public:
void ClearSortGroupFields()
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace